In [1]:
import pandas as pd

In [2]:
d1 = {
    "restaurant": ["Diner","Diner","Pandas","Pandas"],
    "location": [(4,2),(4,2),(5,4),(5,4)],
    "date": ["02/18","05/18","04/18","01/18"],
    "score": [90,100,55,60]
}

In [3]:
df = pd.DataFrame(d1)

In [4]:
df

  restaurant location   date  score
0      Diner   (4, 2)  02/18     90
1      Diner   (4, 2)  05/18    100
2     Pandas   (5, 4)  04/18     55
3     Pandas   (5, 4)  01/18     60

In [5]:
index = pd.MultiIndex.from_tuples(
(("Diner", (4,2)),
 ("Diner", (4,2)),
 ("Pandas", (5,4)),
 ("Pandas", (5,4))),
 names=["restaurant","location"])

In [6]:
df1 = pd.DataFrame(
    {"date": ["02/18","05/18","04/18","01/18"],
     "score": [90,100,55,60]},
    index=index
)

In [7]:
df1

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55
           (5, 4)    01/18     60

In [8]:
df.set_index(["restaurant","location"], inplace=True)

In [9]:
df

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55
           (5, 4)    01/18     60

In [12]:
data = pd.read_csv('data/nyc_inspection_res.csv')

In [13]:
data

                           DBA INSPECTION DATE           SCORE
0       NEW YORK FRIED CHICKEN      04/28/2015            16.0
1   BEN-BEST DELI & RESTAURANT      03/24/2016            42.0
2              ROTI ON THE RUN      01/25/2018             9.0
3  10 02 Lounge and Restaurant      03/01/2018  Not Applicable
4           MANNA'S RESTAURANT             NaN  Not Applicable

In [14]:
data = pd.read_csv('data/nyc_inspection_res.csv',
                  na_values=['Not Applicable',''])

In [15]:
data

                           DBA INSPECTION DATE  SCORE
0       NEW YORK FRIED CHICKEN      04/28/2015   16.0
1   BEN-BEST DELI & RESTAURANT      03/24/2016   42.0
2              ROTI ON THE RUN      01/25/2018    9.0
3  10 02 Lounge and Restaurant      03/01/2018    NaN
4           MANNA'S RESTAURANT             NaN    NaN

In [16]:
data = pd.read_csv('data/nyc_inspection_res.csv',
                  na_values=['Not Applicable',''])

In [17]:
data

                           DBA INSPECTION DATE  SCORE
0       NEW YORK FRIED CHICKEN      04/28/2015   16.0
1   BEN-BEST DELI & RESTAURANT      03/24/2016   42.0
2              ROTI ON THE RUN      01/25/2018    9.0
3  10 02 Lounge and Restaurant      03/01/2018    NaN
4           MANNA'S RESTAURANT             NaN    NaN
5                          Nan      03/01/2018   18.0

In [18]:
data = pd.read_csv('data/nyc_inspection_res.csv',
                  na_values=['Not Applicable',''],
                  keep_default_na=False)
data

                           DBA INSPECTION DATE  SCORE
0       NEW YORK FRIED CHICKEN      04/28/2015   16.0
1   BEN-BEST DELI & RESTAURANT      03/24/2016   42.0
2              ROTI ON THE RUN      01/25/2018    9.0
3  10 02 Lounge and Restaurant      03/01/2018    NaN
4           MANNA'S RESTAURANT             NaN    NaN
5                          Nan      03/01/2018   18.0

In [20]:
data['DBA']

0         NEW YORK FRIED CHICKEN
1     BEN-BEST DELI & RESTAURANT
2                ROTI ON THE RUN
3    10 02 Lounge and Restaurant
4             MANNA'S RESTAURANT
5                            Nan
Name: DBA, dtype: object

In [21]:
data['SCORE'].dtype

dtype('float64')

In [23]:
data.dtypes

DBA                 object
INSPECTION DATE     object
SCORE              float64
dtype: object

In [42]:
data = pd.read_csv( 'data/nyc_inspection_res.csv',
                  na_values=['Not Applicable',''],
                  keep_default_na=False )
data

                           DBA INSPECTION DATE  SCORE
0       NEW YORK FRIED CHICKEN      04/28/2015   16.0
1   BEN-BEST DELI & RESTAURANT      03/24/2016   42.0
2              ROTI ON THE RUN      01/25/2018    9.0
3  10 02 Lounge and Restaurant      03/01/2018    NaN
4           MANNA'S RESTAURANT             NaN    NaN
5                          Nan      03/01/2018   18.0

In [43]:
data.dtypes

DBA                 object
INSPECTION DATE     object
SCORE              float64
dtype: object

In [44]:
df

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55
           (5, 4)    01/18     60

In [45]:
df['score']

restaurant  location
Diner       (4, 2)       90
            (4, 2)      100
Pandas      (5, 4)       55
            (5, 4)       60
Name: score, dtype: int64

In [50]:
df[ df['score'] >= 90 ]

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100

In [51]:
df[ df['date'] >= "04/18" ]

                      date  score
restaurant location
Diner      (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55

In [53]:
df.where(df['score'] >= 90).where(df['date'] >= "04/18")

                      date  score
restaurant location
Diner      (4, 2)      NaN    NaN
           (4, 2)    05/18  100.0
Pandas     (5, 4)      NaN    NaN
           (5, 4)      NaN    NaN

In [58]:
df.where(df['score'] >= 90).where(df['date'] >= "04/18").dropna()

                      date  score
restaurant location
Diner      (4, 2)    05/18  100.0

In [59]:
df.iloc[[0]]

                      date  score
restaurant location
Diner      (4, 2)    02/18     90

In [60]:
df.iloc[[0,2]]

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
Pandas     (5, 4)    04/18     55

In [62]:
df.iloc[[0,3]]

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
Pandas     (5, 4)    01/18     60

In [63]:
df

                      date  score
restaurant location
Diner      (4, 2)    02/18     90
           (4, 2)    05/18    100
Pandas     (5, 4)    04/18     55
           (5, 4)    01/18     60

In [64]:
df.iloc[0] = ("04/18", "100")

In [65]:
df

                      date score
restaurant location
Diner      (4, 2)    04/18   100
           (4, 2)    05/18   100
Pandas     (5, 4)    04/18    55
           (5, 4)    01/18    60

In [68]:
df.loc[[("Diner", (4,2))]]

                      date score
restaurant location
Diner      (4, 2)    04/18   100
           (4, 2)    05/18   100

In [69]:
df.loc["Diner"]

           date score
location
(4, 2)    04/18   100
(4, 2)    05/18   100

In [86]:
df.loc[[("Diner")]][['score']]

                    score
restaurant location
Diner      (4, 2)     100
           (4, 2)     100

In [105]:
df.loc[['Pandas']][['score']]

                    score
restaurant location
Pandas     (5, 4)      55
           (5, 4)      60